Tekla Open API Reference for Tekla Structures 2025
HierarchicDefinition.Drawable Property
 Defines whether the hierarchical definition is a drawable area in the model.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Drawable { get; set; }
Public Property Drawable As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
HierarchicDefinition Class
Tekla.Structures.Model Namespace